Autodesk.Revit.DB.Structure.RebarCrankTypeUtils.GetEditedBarTypeId
Since:
2026

Autodesk.Revit.DB.Structure.RebarCrankTypeUtils.SetEditedBarTypeId(Autodesk.Revit.DB.ElementId)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.Structure.RebarCrankTypeUtils.SetCrankOffsetMultiplier(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.Double)
Sets the crank offset multiplier value.
document:
The document.
rebarCrankTypeId:
The Rebar Crank Type id.
crankOffsetMultiplier:
The crank offset multiplier value.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The rebarCrankTypeId doesn't represent a valid Rebar Crank Type. It should be an ElementType of BuiltInCategory.OST_RebarCrankType category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for crankOffsetMultiplier must be positive.
Since:
2026

Autodesk.Revit.DB.Structure.RebarCrankTypeUtils.GetCrankOffsetMultiplier(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Gets the crank offset multiplier value.
document:
The document.
rebarCrankTypeId:
The Rebar Crank Type id.
Returns:
Returns the crank offset multiplier value.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The rebarCrankTypeId doesn't represent a valid Rebar Crank Type. It should be an ElementType of BuiltInCategory.OST_RebarCrankType category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.Structure.RebarCrankTypeUtils.SetCrankLengthMultiplier(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.Double)
Sets the crank length multiplier value.
document:
The document.
rebarCrankTypeId:
The Rebar Crank Type id.
crankLengthMultiplier:
The crank length multiplier value.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The rebarCrankTypeId doesn't represent a valid Rebar Crank Type. It should be an ElementType of BuiltInCategory.OST_RebarCrankType category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for crankLengthMultiplier must be positive.
Since:
2026

Autodesk.Revit.DB.Structure.RebarCrankTypeUtils.GetCrankLengthMultiplier(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Gets the crank length multiplier value.
document:
The document.
rebarCrankTypeId:
The Rebar Crank Type id.
Returns:
Returns the crank length multiplier value.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The rebarCrankTypeId doesn't represent a valid Rebar Crank Type. It should be an ElementType of BuiltInCategory.OST_RebarCrankType category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.Structure.RebarCrankTypeUtils.SetCrankRatio(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.Double)
Sets the crank ratio value.
Remarks:
The crank slope is 1/crankRatio.
document:
The document.
rebarCrankTypeId:
The Rebar Crank Type id.
crankRatio:
The crank ratio value.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The rebarCrankTypeId doesn't represent a valid Rebar Crank Type. It should be an ElementType of BuiltInCategory.OST_RebarCrankType category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for crankRatio must be positive.
Since:
2026

Autodesk.Revit.DB.Structure.RebarCrankTypeUtils.GetCrankRatio(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Gets the crank ratio value.
Remarks:
The crank slope is 1/crankRatio.
document:
The document.
rebarCrankTypeId:
The Rebar Crank Type id.
Returns:
Returns the crank ratio value.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The rebarCrankTypeId doesn't represent a valid Rebar Crank Type. It should be an ElementType of BuiltInCategory.OST_RebarCrankType category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.Structure.RebarCrankTypeUtils.GetAllRebarCrankTypes(Autodesk.Revit.DB.Document)
Gets all the Rebar Crank Types elements from the document.
Remarks:
Internally this function is returning all element ids from a FilteredElementCollector of category BuiltInCategory.OST_RebarCrankType.
document:
The document.
Returns:
Returns all the Rebar Crank Types elements from the document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.Structure.RebarCrankTypeUtils.CreateRebarCrankType(Autodesk.Revit.DB.Document,System.String)
Creates a Rebar Crank Type element.
document:
The document.
typeName:
The Rebar Crank Type name.
Returns:
The Rebar Crank Type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for typeName cannot be an empty string.
-or-
The given value for typeName cannot include prohibited characters.
-or-
The given value for typeName is already in use by another Rebar Crank Type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.Structure.RebarCrankTypeUtils
Utility class for dealing with Rebar Crank Type operations.
To find all Rebar Crank Types in the document can be done using FilteredElementCollector of category BuiltInCategory.OST_RebarCrankType.
Since:
2026